Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.17/atdf/PIC32CX1025SG61128.atdf
        <module name="CAN" id="U2003" version="3.2.1">
          <instance name="CAN0">
            <register-group name="CAN0" name-in-module="CAN" address-space="base" offset="0x42000000"/>
            <signals>
              <signal group="RX" function="I" pad="PA23"/>
              <signal group="RX" function="I" pad="PA25"/>
              <signal group="TX" function="I" pad="PA22"/>
              <signal group="TX" function="I" pad="PA24"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DEBUG" value="20" caption="DMA CAN Debug Req"/>
              <param name="GCLK_ID" value="27" caption="Index of Generic Clock"/>
              <param name="MSG_RAM_ADDR" value="0x20000000"/>
              <param name="QOS_RESET_VAL" value="1" caption="QOS reset value"/>
              <param name="INSTANCE_ID" value="64" caption="Instance index for CAN0"/>
            </parameters>
          </instance>
          <instance name="CAN1">
            <register-group name="CAN1" name-in-module="CAN" address-space="base" offset="0x42000400"/>
            <signals>
              <signal group="RX" function="H" pad="PB13"/>
              <signal group="RX" function="H" pad="PB15"/>
              <signal group="TX" function="H" pad="PB12"/>
              <signal group="TX" function="H" pad="PB14"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DEBUG" value="21" caption="DMA CAN Debug Req"/>
              <param name="GCLK_ID" value="28" caption="Index of Generic Clock"/>
              <param name="MSG_RAM_ADDR" value="0x20000000"/>
              <param name="QOS_RESET_VAL" value="1" caption="QOS reset value"/>
              <param name="INSTANCE_ID" value="65" caption="Instance index for CAN1"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="1.1.0">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42003800"/>
            <signals>
              <signal group="IN" index="0" function="N" pad="PA04"/>
              <signal group="IN" index="0" function="N" pad="PA16"/>
              <signal group="IN" index="0" function="N" pad="PB22"/>
              <signal group="IN" index="1" function="N" pad="PA05"/>
              <signal group="IN" index="1" function="N" pad="PA17"/>
              <signal group="IN" index="1" function="N" pad="PB00"/>
              <signal group="IN" index="2" function="N" pad="PA06"/>
              <signal group="IN" index="2" function="N" pad="PA18"/>
              <signal group="IN" index="2" function="N" pad="PB01"/>
              <signal group="IN" index="3" function="N" pad="PA08"/>
              <signal group="IN" index="3" function="N" pad="PA30"/>
              <signal group="IN" index="4" function="N" pad="PA09"/>
              <signal group="IN" index="4" function="N" pad="PC27"/>
              <signal group="IN" index="5" function="N" pad="PA10"/>
              <signal group="IN" index="5" function="N" pad="PC28"/>
              <signal group="IN" index="6" function="N" pad="PA22"/>
              <signal group="IN" index="6" function="N" pad="PB06"/>
              <signal group="IN" index="7" function="N" pad="PA23"/>
              <signal group="IN" index="7" function="N" pad="PB07"/>
              <signal group="IN" index="8" function="N" pad="PA24"/>
              <signal group="IN" index="8" function="N" pad="PB08"/>
              <signal group="IN" index="9" function="N" pad="PB14"/>
              <signal group="IN" index="9" function="N" pad="PC20"/>
              <signal group="IN" index="10" function="N" pad="PB15"/>
              <signal group="IN" index="10" function="N" pad="PC21"/>
              <signal group="IN" index="11" function="N" pad="PB10"/>
              <signal group="IN" index="11" function="N" pad="PB16"/>
              <signal group="OUT" index="0" function="N" pad="PA07"/>
              <signal group="OUT" index="0" function="N" pad="PA19"/>
              <signal group="OUT" index="0" function="N" pad="PB02"/>
              <signal group="OUT" index="0" function="N" pad="PB23"/>
              <signal group="OUT" index="1" function="N" pad="PA11"/>
              <signal group="OUT" index="1" function="N" pad="PA31"/>
              <signal group="OUT" index="1" function="N" pad="PB11"/>
              <signal group="OUT" index="2" function="N" pad="PA25"/>
              <signal group="OUT" index="2" function="N" pad="PB09"/>
              <signal group="OUT" index="3" function="N" pad="PB17"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="33" caption="GCLK index for CCL"/>
              <param name="LUT_NUM" value="4" caption="Number of LUT in a CCL"/>
              <param name="SEQ_NUM" value="2" caption="Number of SEQ in a CCL"/>
              <param name="INSTANCE_ID" value="78" caption="Instance index for CCL"/>
            </parameters>
          </instance>
        </module>
        <module name="CMCC" id="U2015" version="6.0.0">
          <instance name="CMCC">
            <register-group name="CMCC" name-in-module="CMCC" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35" caption="Instance index for CMCC"/>
            </parameters>
          </instance>
        </module>
        <module name="DAC" id="U2502" version="1.0.0">
          <instance name="DAC">
            <register-group name="DAC" name-in-module="DAC" address-space="base" offset="0x43002400"/>
            <signals>
              <signal group="VOUT" index="0" function="B" pad="PA02"/>
              <signal group="VOUT" index="1" function="B" pad="PA05"/>
            </signals>
            <parameters>
              <param name="CHANNEL_SIZE" value="2" caption="Number of DACs"/>
              <param name="DATA_SIZE" value="12" caption="Number of bits in data"/>
              <param name="DMAC_ID_EMPTY0" value="72" caption="Index of DMA DAC Channel 0 Empty request"/>
              <param name="DMAC_ID_EMPTY1" value="73" caption="Index of DMA DAC Channel 1 Empty request"/>
              <param name="DMAC_ID_RESRDY0" value="74" caption="Index of DMA DAC Channel 0 Result Ready request"/>
              <param name="DMAC_ID_RESRDY1" value="75" caption="Index of DMA DAC Channel 1 Result Ready request"/>
              <param name="GCLK_ID" value="42" caption="Index of Generic Clock"/>
              <param name="STEP" value="7" caption="Number of steps to reach full scale"/>
              <param name="INSTANCE_ID" value="105" caption="Instance index for DAC"/>
            </parameters>
          </instance>
        </module>
